app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "sdf-ft03"], ["email", "mail@mail.com"], ["password_digest", "[FILTERED]"], ["created_at", "2023-03-22 08:23:10.376713"], ["updated_at", "2023-03-22 08:23:10.376713"]]
---
    def register
        user= User.create(user_params)